[{"id":"y8fvjibsejsskg330wh4","title":"VS Code ","snippet":"VS Code node:console Fix","mainbody":"I've been using Microsoft's Visual Studio Code text editor for years with great success. The app has always been stable, flexible, and the best compliment I can give it: an afterthought. Recently, however, every time I added a console.log to a JavaScript file, VS Code would add import console from 'node:console'; to the top of file.\r\n\r\nWebsite performance monitoring\r\nAs you could imagine, that insertion would break the build and annoy the hell out of me. My colleague Brad Decker would come to the team's rescue with the following addition to our repository:\r\n\r\n// jsconfig.json\r\n{\r\n  \"exclude\": [\"node:console\"]\r\n}\r\nWith that jsconfig.json file, VS Code would no longer import a non-existent file that broke the build. Thank you to Brad for the bug fix and productivity boost!"},{"id":"mwvvfu0el5ocrmhtnyjs","title":"Relationship Hacks","snippet":"Playing video games and having hobbies while avoiding resentment","mainbody":"Super Nintendo Controller from PexelsI'm going to try to finished my Relationship Hacks book in 2019. I've been sitting on it too long. I'm going to try to use blog posts to spur myself into action.\r\n\r\nA number of people asked me what projects, what code, what open source I did over the long holiday. ZERO. I did squat. I played video games, in fact. A bunch of them. I felt a little guilty then I got over it.\r\n\r\nThe Fun of Finishing - Exploring old games with Xbox Backwards Compatibility\r\n\r\nI'm not a big gamer but I like a good story. I do single player with a plot. I consider a well-written video game to be up there with a good book or a great movie. I like a narrative and a beginning and end. Since it was the holidays, it did require some thought to play games.\r\n\r\nWhen you're in a mixed relationship (a geek/techie and a non-techie) you need to be respectful of your partner's expectations. The idea of burning 4-6 hours playing games likely doesn't match up with your partner's idea of a good time. That's where communication comes in. We've found this simple system useful. It's non-gendered and should work for all types of relationships.\r\n\r\nMy spouse and I sat down at the beginning of our holiday vacation and asked each other \"What do you hope to get out of this time?\" Setting expectations up front avoids quiet resentment building later. She had a list of to-dos and projects, I wanted to veg.\r\n\r\nSitting around all day (staycation) is valid, as is using the time to take care of business (TCB). We set expectations up front to avoid conflict. We effectively scheduled my veg time so it was planned and accepted and it was *ok and guilt-free*\r\n\r\nWe've all seen the trope of the gamer hyper-focused on their video game while the resentful partner looks on. My spouse and I want to avoid that - so we do. If she knows I want to immerse myself in a game, a simple heads up goes a LONG way. We sit together, she reads, I play.\r\n\r\nIt's important to not sneak these times up on your partner. \"I was planning on playing all night\" can butt up against \"I was hoping we'd spend time together.\" Boom, conflict and quiet resentment can start. Instead, a modicum of planning. A simple headsup and balance helps.\r\n\r\nI ended up playing about 2-3 days a week, from around 8-9pm to 2am (so a REAL significant amount of time) while we hung out on the other 4-5 days. My time was after the kids were down. My wife was happy to see me get to play (and finish!) games I'd had for years.\r\n\r\nAlso, the recognition from my spouse that while she doesn't personal value my gaming time - she values that *I* value it. Avoid belittling or diminishing your partner's hobby. If you do, you'll find yourself pushing (or being pushed) away.\r\n\r\nOne day perhaps I'll get her hooked on a great game and one day I'll enjoy a Hallmark movie. Or not. ;) But for now, we enjoy knowing and respecting that we each enjoy (and sometimes share) our hobbies. End of thread.\r\n\r\nIf you enjoy my wife's thinking, check her out on my podcast The Return of Mo. My wife and I also did a full podcast with audio over our Cancer Year "},{"id":"fxiy296si1sg101ko1p9","title":"Umarhon's first blog","snippet":"Nothing special","mainbody":"The very first blog ever created on this website"},{"id":"21pizxy6dpvp1anmjjrl","title":"Welcome to My New Office","snippet":"My first professional web development was at a small print shop where I sat in a windowless ","mainbody":"I work remotely and have chosen to have a home office instead of use a coworking space -- I'm a homebody that, despite the interruption caused by family, love to be there for them.  My office's location within the house isn't ideal -- it's right off of the front door.  Lots of traffic and noise but I'll show you how I deal with that in a moment.\r\n\r\n\r\n\r\nI love the French doors but they give me the feeling that I'm being watched; maybe that's what keeps me on task most of the time.\r\n\r\nBeer...Beverage Fridge & Coffee Maker\r\nHaving both a fridge and a coffee maker in my office is a must! I can enjoy refreshments without leaving my office, which is really important since I can get sidetracked by my family or my own curiosity when I step out.\r\n\r\n\r\nSince I do a fair amount of late night blogging and gaming in my office, I'm known to sneak a beer or two to fuel my creativity. Most of the time, however, I'm guzzling sparkling water, fruit smoothies, or making myself an afternoon coffee.\r\n\r\nDesk\r\nMy previous office had standing desk and ergonomic chair which I enjoyed for a while but the truth is that those items are prone to breaking constantly since they're moved so frequently. When I refreshed my office, I went all on a beast of a desk.\r\n\r\n\r\n\r\nThis Evodesk desk has loads of cool features:\r\n\r\nAdjustable height via digital control pad\r\nDesktop computer mounting station\r\nDual monitor arms (with 24\" monitors)\r\nSpeakers and mounted subwoofer\r\n12-slot power outlet mounted under the desk to minimize power cords above the desk\r\nBuilt in USB power station"}]